---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ModelWithNoConditionedSpacesWarn
source: html/f90714b0-29c8-588f-338f-80d0b663e518.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ModelWithNoConditionedSpacesWarn Property

The model has no conditioned spaces.

## Syntax (C#)
```csharp
public static FailureDefinitionId ModelWithNoConditionedSpacesWarn { get; }
```